DataProcessors/ЭкспортСписков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ЭкспортСписков</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаЗа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЭС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ведомости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛицевыеСчетаРаботниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчетаРаботниковОрганизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчетаIBAN</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчетаСтарый</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОткрытиеСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорБанка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MGS_ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ТабеляУчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.MGS_Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табельщик</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредседательПрофкома</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЭкспортСписков/Ext/ObjectModule.bsl
Процедура ВыборФайлаДляВыгрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.Каталог;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФайлДляПросмотра(Элемент,Заголовок) Экспорт
	
	//СтандартнаяОбработка = Ложь;
	//
	//ФайлНаДиске = Новый Файл(Элемент.Значение);
	//Если НЕ ФайлНаДиске.Существует() Тогда
	//	Предупреждение("Не найден файл!");
	//	Возврат;
	//КонецЕсли;
	//
	//Текст = Новый ТекстовыйДокумент();
	////Если Кодировка = "DOS" Тогда
	//	Кодир = КодировкаТекста.OEM;
	////Иначе
	////	Кодир = КодировкаТекста.ANSI;
	////КонецЕсли;
	//Текст.Прочитать(Элемент.Значение, Кодир);
	//Текст.Показать(Заголовок,Элемент.Значение);
	
КонецПроцедуры

Процедура Печать() Экспорт
	
	Таб=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("Макет");
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаДоговор=Макет.ПолучитьОбласть("ШапкаДоговор");
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьИтого=Макет.ПолучитьОбласть("Итого");
	ОбластьРуки=Макет.ПолучитьОбласть("Руки");
		
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование КАК ФизЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Код КАК ТабельныйНомер,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма КАК Сумма,
	|	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета КАК ЛицевойСчет,
	|	ЛицевыеСчетаРаботниковОрганизации.ДоговорБанка КАК Договор,
	|	ЛицевыеСчетаРаботниковОрганизации.ДоговорБанка.Владелец КАК Банк,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация КАК Организация
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ЛицевыеСчетаРаботниковОрганизации.ФизЛицо
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Банк = ЛицевыеСчетаРаботниковОрганизации.Банк
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация = ЛицевыеСчетаРаботниковОрганизации.Организация
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка В(&Ведомости)
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Организация,
	|	ДоговорБанка";
	
	Запрос.УстановитьПараметр("Ведомости",Ведомости.ВыгрузитьКолонку("Ведомость"));
	
	ЗапросПоОтветственным=Новый Запрос;
	ЗапросПоОтветственным.Текст=
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо КАК Руководитель,
	|	ОтветственныеЛицаОрганизацийСрезПоследних1.ФизическоеЛицо КАК ГлавныйБухгалтер
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&ДатаАктуальности,
	|			ОтветственноеЛицо = &ГенеральныйДиректор
	|				И СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|				&ДатаАктуальности,
	|				ОтветственноеЛицо = &ГлавныйБухгалтер
	|					И СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних1
	|		ПО (ИСТИНА)";
	
	ЗапросПоОтветственным.УстановитьПараметр("Организация",Организация);
	ЗапросПоОтветственным.УстановитьПараметр("ДатаАктуальности",ВыплатаЗа);
	ЗапросПоОтветственным.УстановитьПараметр("ГенеральныйДиректор",Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	ЗапросПоОтветственным.УстановитьПараметр("ГлавныйБухгалтер",Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	ВыборкаОтветственный=ЗапросПоОтветственным.Выполнить().Выбрать();
	ВыборкаОтветственный.Следующий();
	
	ВыборкаПоОрганизации=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоОрганизации.Следующий() Цикл		
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоОрганизации);
		НП=?(СокрЛП(НомерПП)<>""," № "+СокрЛП(НомерПП)," № ________");
		НП=НП+" от "+?(ДатаПП<>'00010101',Формат(ДатаПП,"ДЛФ=ДД")," ______________ "+Строка(Год(ВыплатаЗа))+" г.");
		ОбластьШапка.Параметры.НП=НП;
		Таб.Вывести(ОбластьШапка);	
		
		ВыборкаПоДоговорам=ВыборкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДоговорам.Следующий() Цикл
			ОбластьШапкаДоговор.Параметры.Заполнить(ВыборкаПоДоговорам);				
			
			ОбластьШапкаДоговор.Параметры.Номер=СокрЛП(НомерСписка);
			ОбластьШапкаДоговор.Параметры.ДСП=Формат(ДатаСписка,"ДЛФ=ДД");
			ОбластьШапкаДоговор.Параметры.ДЗП=Формат(ВыплатаЗа,"ДЛФ=ДД");
			ОбластьШапкаДоговор.Параметры.ЧтоЭто=СокрЛП(НазначениеПлатежа);
						
			Таб.Вывести(ОбластьШапкаДоговор);	
			ВыборкаПоСотрудникам=ВыборкаПоДоговорам.Выбрать();
			Нпп=1;
			Пока ВыборкаПоСотрудникам.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаПоСотрудникам);
				ОбластьСтрока.Параметры.Нпп=Нпп;
				Таб.Вывести(ОбластьСтрока);
				Нпп=Нпп+1;
			КонецЦикла;			
			ОбластьИтого.Параметры.Заполнить(ВыборкаПоДоговорам);
			ОбластьИтого.Параметры.ИтогСписок=РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаПоДоговорам.Сумма, Константы.ВалютаРегламентированногоУчета.Получить());
			Таб.Вывести(ОбластьИтого);			
			ОбластьРуки.Параметры.Руководитель=УправлениеОтчетамиЗК.ФамилияИнициалыОтветсвенногоЛица(ВыборкаОтветственный.Руководитель);
			ОбластьРуки.Параметры.ГлавныйБухгалтер=УправлениеОтчетамиЗК.ФамилияИнициалыОтветсвенногоЛица(ВыборкаОтветственный.ГлавныйБухгалтер);
			Таб.Вывести(ОбластьРуки);
			Таб.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;		
	КонецЦикла; 
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьСетку=Ложь;
	Таб.АвтоМасштаб=Истина;
	Таб.ОтображатьЗаголовки=Ложь;
	
	Таб.Показать();
	
КонецПроцедуры

Функция ФорматЛицевогоСчета(ЛицевойСчет)
	
	ЛицевойСчетФ=СокрЛП(ЛицевойСчет);
	
	Если ФорматЭС=1 ТОгда
		ЛицевойСчетФ=Строка( Формат(Цел(Число(СокрЛП(ЛицевойСчет))/1000000),"ЧГ=") )+" "+Строка( Формат((Окр(Число(СокрЛП(ЛицевойСчет))/1000000,6)-Цел(Число(СокрЛП(ЛицевойСчет))/1000000))*1000000,"ЧГ=") );			
	КонецЕсли;

	Возврат ЛицевойСчетФ;
	
КонецФункции
	
Процедура Выгрузить() Экспорт
	
	ЗапросБанк=Новый Запрос;
	ЗапросБанк.УстановитьПараметр("Ведомости",Ведомости.ВыгрузитьКолонку("Ведомость"));
	
	ЗапросБанк.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет.Банк.НомерФилиала КАК НомерФилиала,
	|	ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	ЗарплатаКВыплатеОрганизаций.Ответственный.ФизЛицо КАК Ответственный
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизаций.Ссылка В(&Ведомости)";
	
	НомерФилиала="";
	НомерСчета="";
	Ответственный="";
	
	ВыборкаБанк=ЗапросБанк.Выполнить().Выбрать();
	
	Если ВыборкаБанк.Следующий() ТОгда
		
		НомерФилиала=ВыборкаБанк.НомерФилиала;
		НомерСчета=ВыборкаБанк.НомерСчета;
		Ответственный=ВыборкаБанк.Ответственный;
		
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование КАК ФизЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма КАК Сумма,
	|	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета КАК НомерЛицевогоСчета
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ЛицевыеСчетаРаботниковОрганизации.ФизЛицо
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Банк = ЛицевыеСчетаРаботниковОрганизации.Банк
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация = ЛицевыеСчетаРаботниковОрганизации.Организация
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка В(&Ведомости)
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Ведомости",Ведомости.ВыгрузитьКолонку("Ведомость"));
	
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ФайлСписка=Новый ТекстовыйДокумент;
	
	Если Выборка.Следующий() Тогда
		Если ТипКлиента=0 ТОгда
			
			ФайлСписка.ДобавитьСтроку("***** ^Type=46^ ^Acc=0000000000000^ - Список на выдачу заработной платы");
			ФайлСписка.ДобавитьСтроку("[IN_PARAM]");
			ФайлСписка.ДобавитьСтроку("^AccountBYR="+Формат(Выборка.Сумма,"ЧЦ=18;ЧГ=0;ЧДЦ=2;ЧРД="".""")+"^");
			ФайлСписка.ДобавитьСтроку("^N_poruch="+Строка(НомерПП)+"^");                              
			ФайлСписка.ДобавитьСтроку("^Period="+Формат(ВыплатаЗа,"ДФ='ММММ"","" гггг'")+"^"); 
			ТабличнаяЧастьСписка="";
			
			ВыборкаСотрудников=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			НомерВСписке=1;
			
			Пока ВыборкаСотрудников.Следующий() Цикл
				
				ТабличнаяЧастьСписка=ТабличнаяЧастьСписка+"Npp1="+НомерВСписке+"~Name1="+СокрЛП(ВыборкаСотрудников.ФизЛицо)+"~Nch1="+ФорматЛицевогоСчета(ВыборкаСотрудников.НомерЛицевогоСчета)+"~Sum1="+СокрЛП(Формат(ВыборкаСотрудников.Сумма,"ЧЦ=18;ЧГ=0;ЧДЦ=2;ЧРД=""."""))+"~";	
				
				НомерВСписке=НомерВСписке+1;
				
			КонецЦикла;		
			
			ТабличнаяЧастьСписка=ТабличнаяЧастьСписка+"^";
			ФайлСписка.ДобавитьСтроку("^_Table="+СокрЛП(Сред(ТабличнаяЧастьСписка,1,999999)));
			ФайлСписка.ДобавитьСтроку("^DatePP="+СокрЛП(Формат(ДатаПП,"ДЛФ=Д"))+"^");                              
			ФайлСписка.ДобавитьСтроку("^Vid_dohoda="+СокрЛП(НазначениеПлатежа)+"^");                              
			ФайлСписка.ДобавитьСтроку("^Date="+СокрЛП(Формат(ДатаСписка,"ДЛФ=Д"))+"^");                              
			ФайлСписка.ДобавитьСтроку("^N_sp=1^");                              
			ФайлСписка.ДобавитьСтроку("^Name="+ВРег(СокрЛП(Организация.Наименование))+"^");                              
			ФайлСписка.ДобавитьСтроку("^UNN="+СокрЛП(Строка(Организация.ИНН))+"^");                              
			ФайлСписка.ДобавитьСтроку("[OUT_PARAM]");
			
		ИначеЕсли ТипКлиента=1 ТОгда
			
			ФайлСписка.ДобавитьСтроку("01"+СокрЛП(Строка(НомерПП)));
			ФайлСписка.ДобавитьСтроку("02"+Формат(ДатаПП,"ДФ=dd/MM/yyyy"));
			ФайлСписка.ДобавитьСтроку("03"+СокрЛП(НомерСписка));                              
			ФайлСписка.ДобавитьСтроку("04"+Формат(ДатаСписка,"ДФ=dd/MM/yyyy"));
			ФайлСписка.ДобавитьСтроку("05"+СокрЛП(НазначениеПлатежа));
			
			ВыборкаСотрудников=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			НомерВСписке=1;
			
			Пока ВыборкаСотрудников.Следующий() Цикл
				
				Попытка
					НомерЛицевогоСчета=ФорматЛицевогоСчета(ВыборкаСотрудников.НомерЛицевогоСчета);					
				Исключение
					Сообщить("Для сотрудника "+ВыборкаСотрудников.ФизЛицо+" выгрузка с таким вариантом электронных списков невозможна! Проверьте его лицевой счет.");
					Продолжить;
				КонецПопытки;
				
				ФайлСписка.ДобавитьСтроку("08"+НомерВСписке);
				ФайлСписка.ДобавитьСтроку("09"+СокрЛП(ВыборкаСотрудников.ФизЛицо));
				ФайлСписка.ДобавитьСтроку("0A"+" "+ФорматЛицевогоСчета(ВыборкаСотрудников.НомерЛицевогоСчета));
				ФайлСписка.ДобавитьСтроку("0B"+СокрЛП(Формат(ВыборкаСотрудников.Сумма,"ЧДЦ=2; ЧРД=.; ЧГ=")));
				
				НомерВСписке=НомерВСписке+1;
				
			КонецЦикла;		
			
			ФайлСписка.ДобавитьСтроку("~");
			
		ИначеЕсли ТипКлиента=2 ТОгда
			
			
			//Если СокрЛП(НомерФилиала)="" ТОгда
			//	Предупреждение("Не указан номер филиала в банке!");
			//	Возврат;
			//КонецЕсли;
			
			ВыборкаСотрудников=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
			
			Пока ВыборкаСотрудников.Следующий() Цикл
											
				//ФайлСписка.ДобавитьСтроку(Лев(СокрЛП(ВыборкаСотрудников.НомерЛицевогоСчета),3)+","+Строка(Формат(Число(Сред(СокрЛП(ВыборкаСотрудников.НомерЛицевогоСчета),4)),"ЧГ="))+","+СокрЛП(ВыборкаСотрудников.ФизЛицо)+","+СокрЛП(Формат(ВыборкаСотрудников.Сумма,"ЧДЦ=2; ЧРД=.; ЧГ=")));
				//ФайлСписка.ДобавитьСтроку(СокрЛП(НомерФилиала)+","+СокрЛП(ВыборкаСотрудников.НомерЛицевогоСчета)+","+СокрЛП(ВыборкаСотрудников.ФизЛицо)+","+СокрЛП(Формат(ВыборкаСотрудников.Сумма,"ЧДЦ=2; ЧРД=.; ЧГ=")));
				ФайлСписка.ДобавитьСтроку(Сред(СокрЛП(ВыборкаСотрудников.НомерЛицевогоСчета),20,3)+","+СокрЛП(ВыборкаСотрудников.НомерЛицевогоСчета)+","+СокрЛП(ВыборкаСотрудников.ФизЛицо)+","+СокрЛП(Формат(ВыборкаСотрудников.Сумма,"ЧДЦ=2; ЧРД=.; ЧГ=")));
				
			КонецЦикла;
			
		ИначеЕсли ТипКлиента=3 ТОгда
			
			
			Если СокрЛП(НомерФилиала)="" ТОгда
				Предупреждение("Не указан номер филиала в банке!");
				Возврат;
			КонецЕсли;
			
			Если СокрЛП(НомерСчета)="" ТОгда
				Предупреждение("Не указан номер расчетного счета!");
				Возврат;
			КонецЕсли;
			
			ФайлСписка.ДобавитьСтроку("<HEADER>");
			ФайлСписка.ДобавитьСтроку("<NSP>"+СокрЛП(НомерСписка));
			ФайлСписка.ДобавитьСтроку("<DSP>"+Формат(ДатаСписка,"ДФ=dd.MM.yyyy"));
			ФайлСписка.ДобавитьСтроку("<NFIL>"+СокрЛП(НомерФилиала));
			ФайлСписка.ДобавитьСтроку("<ACC>"+СокрЛП(НомерСчета));
			ФайлСписка.ДобавитьСтроку("<FISP>"+УправлениеОтчетамиЗК.ФамилияИнициалыОтветсвенногоЛица(Ответственный));
			ФайлСписка.ДобавитьСтроку("<TOTAL_P>");
			ФайлСписка.ДобавитьСтроку("<TOTAL_S>");
			ФайлСписка.ДобавитьСтроку("<NZP>"+СокрЛП(НазначениеПлатежа));
			ФайлСписка.ДобавитьСтроку("<NPP>"+СокрЛП(НомерПП));
			ФайлСписка.ДобавитьСтроку("<DPP>"+Формат(ДатаПП,"ДФ=dd.MM.yyyy"));
			ФайлСписка.ДобавитьСтроку("<VSP>K");
			ФайлСписка.ДобавитьСтроку("<DELIMITER>");
			
			ВыборкаСотрудников=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
			
			КоличествоСтрок=0;
			ИтоговаяСумма=0;
			
			Пока ВыборкаСотрудников.Следующий() Цикл
											
				ФайлСписка.ДобавитьСтроку(СокрЛП(ВыборкаСотрудников.НомерЛицевогоСчета)+" "+СокрЛП(Формат(ВыборкаСотрудников.Сумма,"ЧДЦ=2; ЧРД=.; ЧГ="))+" "+СокрЛП(ВыборкаСотрудников.ФизЛицо));
				КоличествоСтрок=КоличествоСтрок+1;
				ИтоговаяСумма=ИтоговаяСумма+ВыборкаСотрудников.Сумма;
				
			КонецЦикла;	
			
			ФайлСписка.ДобавитьСтроку("<EOD>");
			ФайлСписка.ЗаменитьСтроку(7,"<TOTAL_P>"+Формат(КоличествоСтрок,"ЧГ="));
			ФайлСписка.ЗаменитьСтроку(8,"<TOTAL_S>"+Формат(ИтоговаяСумма,"ЧДЦ=2; ЧРД=.; ЧГ="));
			
		КонецЕсли;		
	КонецЕсли;
	
	ИмяФайла="spiszp"+СокрЛП(НомерПП)+".txt";
	
	ФайлСписка.Записать(ФайлВыгрузки+"\"+ИмяФайла,?(Кодировка=1,КодировкаТекста.ANSI,КодировкаТекста.OEM));
	
	
КонецПроцедуры
